print('Игра "Расшифруй код Морзе!"')

# слова можно закодировать с помощью функций

a = 'code'

def morse(a):
    return '"-.-.""---""-..""."'

b = 'cat'

def morse(b):
    return "-.-."".-""-"

c = 'work'

def morse(a):
    return ".--""---"".-.""-.-"

d = 'hard'

def morse(d):
    return "...."".-"".-.""-.."

e = 'rock'

def morse(e):
    return ".-.""---""-.-.""-.-"



print("Какое слово зашифровано?")

# также можно использовать словарь

asks = {
    '"-.-.""---""-..""."': 'code',
    '"-.-."".-""-"': 'cat',
    '".--""---"".-.""-.-"': 'work',
    '"...."".-"".-.""-.."': 'hard',
    '".-.""---""-.-.""-.-"': 'rock'}

# создаем рандомный выбор

import random

answers_list = ["-.-.""---""-.."".", "-.-."".-""-", ".--""---"".-.""-.-", "...."".-"".-.""-..", ".-.""---""-.-.""-.-"]
random_index = random.randrange(len(answers_list))

# вводим счетчик, выводим попеременно ключ из словаря и сверяем его значение с ответом пользователя

score = 0

for i, j in asks.items():
    print(i)
    answer = str(input("Ваш ответ: "))
    if answer == j:
        print("Правильный ответ!")
        score += 1
    else:
        print(("Ответ не верный! Правильно: " ) + j)

print(("Вы набрали %s очка(-ов)" % score))

